{"links": {"self": {"href": "data/repositories/osrf/sdf_tutorials/pullrequests/13/comments/99571223.json"}, "code": {"href": "https://api.bitbucket.org/2.0/repositories/osrf/sdf_tutorials/diff/osrf/sdf_tutorials:35acbb2706a1..eda3d865c05f?path=spec_model_kinematics%2Ftutorial.md"}, "html": {"href": "#!/osrf/sdf_tutorials/pull-requests/13/_/diff#comment-99571223"}}, "deleted": false, "pullrequest": {"type": "pullrequest", "id": 13, "links": {"self": {"href": "data/repositories/osrf/sdf_tutorials/pullrequests/13.json"}, "html": {"href": "#!/osrf/sdf_tutorials/pull-requests/13"}}, "title": "Replace joint frame references with Jc and Jp"}, "content": {"raw": "I’d say: The <pose> tag specifies the pose X\\_CJc of a joint frame Jc rigidly affixed to the child body frame C. Similarly, a frame Jp is rigidly affixed to the parent body frame P, see figure. A particular joint, such as revolute, specifies how frames Jc and Jp can move relative to each other. In the so called “zero configuration” \\(for instance, zero angle for a revolute joint\\), both frames Jc and Jp are coincident. Notice that the pose of frame Jp in P, coincident with Jc in the zero configuration, is implicit when the poses of P and C are given in the model frame M.”\n\nI don’t see monogram notation in this document as we do use it in Drake. Is the plan to adopt it? if not, you could omit X\\_CJc above and I believe the text should work.  \nThey key ingredients that I like seeing in the language used are: clear distinction between the physical concept of a frame \\(u can think of it as a triplet of unit vectors at a particular location\\) and that of a “pose” \\(sometimes called transform, for which we use monogram notation in Drake\\) which measures the position and orientation of a frame relative to another.\n\nAlso, re the figure above. I think it’d be nice having frames Jp and Jc shown \\(not necessarily concident, so away from the zero configuration\\). I’d place like a little curvy arrow \\(indicating a “transform” or “mapping”\\) between C and Jc, with label X\\_CJc and another curvy arrow between P and Jp, labeled X\\_PJp. An extra could be having yet another arrow between Jp and Jc, this time labeled X\\_JpJc\\(q\\), indicating the configuration dependence.", "markup": "markdown", "html": "<p>I’d say: The &lt;pose&gt; tag specifies the pose X_CJc of a joint frame Jc rigidly affixed to the child body frame C. Similarly, a frame Jp is rigidly affixed to the parent body frame P, see figure. A particular joint, such as revolute, specifies how frames Jc and Jp can move relative to each other. In the so called “zero configuration” (for instance, zero angle for a revolute joint), both frames Jc and Jp are coincident. Notice that the pose of frame Jp in P, coincident with Jc in the zero configuration, is implicit when the poses of P and C are given in the model frame M.”</p>\n<p>I don’t see monogram notation in this document as we do use it in Drake. Is the plan to adopt it? if not, you could omit X_CJc above and I believe the text should work.<br />\nThey key ingredients that I like seeing in the language used are: clear distinction between the physical concept of a frame (u can think of it as a triplet of unit vectors at a particular location) and that of a “pose” (sometimes called transform, for which we use monogram notation in Drake) which measures the position and orientation of a frame relative to another.</p>\n<p>Also, re the figure above. I think it’d be nice having frames Jp and Jc shown (not necessarily concident, so away from the zero configuration). I’d place like a little curvy arrow (indicating a “transform” or “mapping”) between C and Jc, with label X_CJc and another curvy arrow between P and Jp, labeled X_PJp. An extra could be having yet another arrow between Jp and Jc, this time labeled X_JpJc(q), indicating the configuration dependence.</p>", "type": "rendered"}, "created_on": "2019-04-22T23:22:25.120157+00:00", "user": {"display_name": "Alejandro Castro", "uuid": "{f78f4af9-eed7-49c4-b222-5b3dc10d5093}", "links": {"self": {"href": "https://api.bitbucket.org/2.0/users/%7Bf78f4af9-eed7-49c4-b222-5b3dc10d5093%7D"}, "html": {"href": "https://bitbucket.org/%7Bf78f4af9-eed7-49c4-b222-5b3dc10d5093%7D/"}, "avatar": {"href": "data/secure.gravatar.com/avatar/9958cefe61157cc05fbc6d1a77d68a2fd=httpsavatar-management--avatars.us-west-2.prod.public.atl-paas.netinitialsAC-3.png"}}, "nickname": "amcastro0622", "type": "user", "account_id": "557058:82e5965f-3de7-463a-8d2f-5eb310e3ca12"}, "inline": {"to": 143, "from": null, "outdated": true, "path": "spec_model_kinematics/tutorial.md"}, "updated_on": "2019-04-22T23:23:30.991541+00:00", "type": "pullrequest_comment", "id": 99571223}